In [1]:
import numpy as np
import pandas as pd

#  Basic Aggregations

In [2]:
# Creating a DataFrame with the given sales data
data = {'Product': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
        'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North'],
        'Units_Sold': [10, 15, 20, 5, 10, 15, 10, 5, 15],
        'Price': [100, 200, 150, 100, 200, 150, 100, 200, 150]}

df_sales = pd.DataFrame(data)

# Displaying the DataFrame
df_sales

  Product Region  Units_Sold  Price
0       A  North          10    100
1       B  South          15    200
2       C   East          20    150
3       A   West           5    100
4       B  North          10    200
5       C  South          15    150
6       A   East          10    100
7       B   West           5    200
8       C  North          15    150

In [3]:
# Calculating the 'Revenue' column
df_sales['Revenue'] = df_sales['Units_Sold'] * df_sales['Price']

# Displaying the updated DataFrame
df_sales

  Product Region  Units_Sold  Price  Revenue
0       A  North          10    100     1000
1       B  South          15    200     3000
2       C   East          20    150     3000
3       A   West           5    100      500
4       B  North          10    200     2000
5       C  South          15    150     2250
6       A   East          10    100     1000
7       B   West           5    200     1000
8       C  North          15    150     2250

In [4]:
# Calculating the total 'Units_Sold' and total 'Revenue'
total_units_sold = df_sales['Units_Sold'].sum()
total_revenue = df_sales['Revenue'].sum()

# Displaying the results
print("Total Units Sold:", total_units_sold)
print("Total Revenue:", total_revenue)

Total Units Sold: 105
Total Revenue: 16000

In [5]:
# Calculating the average 'Units_Sold' and average 'Revenue'
avg_units_sold = df_sales['Units_Sold'].mean()
avg_revenue = df_sales['Revenue'].mean()

# Displaying the results
print("Average Units Sold:", avg_units_sold)
print("Average Revenue:", avg_revenue)

Average Units Sold: 11.666666666666666
Average Revenue: 1777.7777777777778

# Grouping Data

In [6]:
# Grouping by 'Product' and calculating the total 'Units_Sold' and 'Revenue' for each product
product_group = df_sales.groupby('Product').agg({'Units_Sold':'sum', 'Revenue':'sum'})

# Displaying the results
print(product_group)

         Units_Sold  Revenue
Product
A                25     2500
B                30     6000
C                50     7500

In [7]:
# Grouping by 'Region' and calculating the average 'Units_Sold' and 'Revenue' for each region
region_group = df_sales.groupby('Region').agg({'Units_Sold':'mean', 'Revenue':'mean'})

# Displaying the results
print(region_group)

        Units_Sold  Revenue
Region
East     15.000000   2000.0
North    11.666667   1750.0
South    15.000000   2625.0
West      5.000000    750.0

In [8]:
# Grouping by both 'Product' and 'Region' and calculating the sum of 'Units_Sold' and 'Revenue'
product_region_group = df_sales.groupby(['Product', 'Region']).agg({'Units_Sold':'sum', 'Revenue':'sum'})

# Displaying the results
print(product_region_group)

                Units_Sold  Revenue
Product Region
A       East            10     1000
        North           10     1000
        West             5      500
B       North           10     2000
        South           15     3000
        West             5     1000
C       East            20     3000
        North           15     2250
        South           15     2250

# Sorting and Ranking Data

In [9]:
# Sorting df_sales by 'Units_Sold' in ascending order
df_sales_sorted = df_sales.sort_values('Units_Sold', ascending=True)

# Displaying the sorted DataFrame
print(df_sales_sorted)

  Product Region  Units_Sold  Price  Revenue
3       A   West           5    100      500
7       B   West           5    200     1000
4       B  North          10    200     2000
0       A  North          10    100     1000
6       A   East          10    100     1000
1       B  South          15    200     3000
5       C  South          15    150     2250
8       C  North          15    150     2250
2       C   East          20    150     3000

In [10]:
# Sorting df_sales by 'Revenue' in descending order
df_sales_sorted = df_sales.sort_values('Revenue', ascending=False)

# Displaying the sorted DataFrame
print(df_sales_sorted)

  Product Region  Units_Sold  Price  Revenue
1       B  South          15    200     3000
2       C   East          20    150     3000
8       C  North          15    150     2250
5       C  South          15    150     2250
4       B  North          10    200     2000
0       A  North          10    100     1000
6       A   East          10    100     1000
7       B   West           5    200     1000
3       A   West           5    100      500

In [11]:
# Adding a new column 'Revenue_Rank' that ranks the 'Revenue' values in descending order
df_sales['Revenue_Rank'] = df_sales['Revenue'].rank(ascending=False)

# Displaying the updated DataFrame
print(df_sales)

  Product Region  Units_Sold  Price  Revenue  Revenue_Rank
0       A  North          10    100     1000           7.0
1       B  South          15    200     3000           1.5
2       C   East          20    150     3000           1.5
3       A   West           5    100      500           9.0
4       B  North          10    200     2000           5.0
5       C  South          15    150     2250           3.5
6       A   East          10    100     1000           7.0
7       B   West           5    200     1000           7.0
8       C  North          15    150     2250           3.5

In [12]:
df_sales

  Product Region  Units_Sold  Price  Revenue  Revenue_Rank
0       A  North          10    100     1000           7.0
1       B  South          15    200     3000           1.5
2       C   East          20    150     3000           1.5
3       A   West           5    100      500           9.0
4       B  North          10    200     2000           5.0
5       C  South          15    150     2250           3.5
6       A   East          10    100     1000           7.0
7       B   West           5    200     1000           7.0
8       C  North          15    150     2250           3.5

#  Merging DataFrames

In [13]:
# Creating a DataFrame with the given product data
product_data = {'Product': ['A', 'B', 'C'],
                'Category': ['Electronics', 'Furniture', 'Appliances']}

df_products = pd.DataFrame(product_data)

# Displaying the DataFrame
df_products

  Product     Category
0       A  Electronics
1       B    Furniture
2       C   Appliances

In [14]:
# Merging df_sales with df_products on the 'Product' column
df_merged = pd.merge(df_sales, df_products, on='Product')

# Displaying the merged DataFrame
df_merged

  Product Region  Units_Sold  Price  Revenue  Revenue_Rank     Category
0       A  North          10    100     1000           7.0  Electronics
1       B  South          15    200     3000           1.5    Furniture
2       C   East          20    150     3000           1.5   Appliances
3       A   West           5    100      500           9.0  Electronics
4       B  North          10    200     2000           5.0    Furniture
5       C  South          15    150     2250           3.5   Appliances
6       A   East          10    100     1000           7.0  Electronics
7       B   West           5    200     1000           7.0    Furniture
8       C  North          15    150     2250           3.5   Appliances

In [15]:
# Calculate the total 'Revenue' by 'Category'
revenue_by_category = df_merged.groupby('Category')['Revenue'].sum()

# Display the results
print(revenue_by_category)

Category
Appliances     7500
Electronics    2500
Furniture      6000
Name: Revenue, dtype: int64